---
kind: property
id: P:Autodesk.Revit.DB.GroupLoadOptions.ReplaceDuplicatedGroups
source: html/4a2a99b6-42f2-ecb4-30a0-fdd0bf82929e.htm
---
# Autodesk.Revit.DB.GroupLoadOptions.ReplaceDuplicatedGroups Property

If there are groups with the same names in source and destination documents set this property to True true true ( True in Visual Basic) to replace existing groups,
 otherwise the operation will be canceled. The default value is False false false ( False in Visual Basic) .

## Syntax (C#)
```csharp
public bool ReplaceDuplicatedGroups { get; set; }
```